trip1/esp32-projects/firmware/bme280-mqtt-sensor/src/main.cpp
#include <Adafruit_BME280.h>
#include <Arduino.h>
#include <ArduinoJson.h>
#include <DNSServer.h>
#include <Preferences.h>
#include <PubSubClient.h>
#include <SPI.h>
#include <WiFi.h>
#include <Wire.h>
#include <esp_mac.h>
#include <esp_sleep.h>
#include <esp_system.h>
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/task.h>
#include <lwip/sockets.h>

#include <cerrno>
#include <cmath>
#include <cstddef>
#include <cstdlib>
#include <cstring>
#include <string>

#include "sensor_config_logic.h"

#ifndef SENSOR_SDA_PIN
#error "SENSOR_SDA_PIN must be defined by the board environment"
#endif
#ifndef SENSOR_SCL_PIN
#error "SENSOR_SCL_PIN must be defined by the board environment"
#endif
#ifndef SENSOR_SPI_SCK_PIN
#error "SENSOR_SPI_SCK_PIN must be defined by the board environment"
#endif
#ifndef SENSOR_SPI_MISO_PIN
#error "SENSOR_SPI_MISO_PIN must be defined by the board environment"
#endif
#ifndef SENSOR_SPI_MOSI_PIN
#error "SENSOR_SPI_MOSI_PIN must be defined by the board environment"
#endif
#ifndef SENSOR_SPI_CS_PIN
#error "SENSOR_SPI_CS_PIN must be defined by the board environment"
#endif
#ifndef SETUP_BUTTON_PIN
#error "SETUP_BUTTON_PIN must be defined by the board environment"
#endif

namespace {
constexpr uint32_t kConfigMagic = 0x424d4532U;
constexpr uint16_t kConfigVersion = 1U;
constexpr uint32_t kWifiTimeoutMs = 60000U;
constexpr uint32_t kWifiStableMs = 750U;
constexpr uint32_t kMqttConfirmationTimeoutMs = 5000U;
constexpr uint32_t kMqttConnectDeadlineMs = 6000U;
constexpr uint8_t kMqttPublishAttempts = 3U;
constexpr uint32_t kMqttRetryDelayMs = 750U;
constexpr uint32_t kProvisioningTimeoutMs = 10U * 60U * 1000U;
constexpr uint32_t kRecoveryWindowMs = 5000U;
constexpr uint32_t kRecoveryHoldMs = 2000U;
constexpr uint32_t kFallbackSleepMinutes = 5U;
constexpr uint32_t kSensorReadTimeoutMs = 6000U;
constexpr size_t kMaximumRequestBytes = 2048U;
constexpr size_t kMaximumHeaderBytes = 1024U;
constexpr size_t kMaximumBodyBytes = 1024U;
constexpr uint32_t kRejectedPendingMarker = 0x52504e44U;
constexpr size_t kSetupPasswordCharacters = 8U;
constexpr char kSetupPasswordAlphabet[] = "ABCDEFGHJKLMNPQRSTUVWXYZ23456789";
static_assert(sizeof(kSetupPasswordAlphabet) - 1U == 32U, "password alphabet must preserve unbiased five-bit selection");
RTC_DATA_ATTR uint32_t rejected_pending_marker = 0U;

class DeadlineWiFiClient : public WiFiClient {
public:
    void startDeadline(uint32_t duration_ms) {
        deadline_started_ms_ = millis();
        deadline_duration_ms_ = duration_ms;
        deadline_active_ = true;
    }

    bool deadlineExpired() const {
        return deadline_active_ && static_cast<uint32_t>(millis() - deadline_started_ms_) >= deadline_duration_ms_;
    }

    uint32_t remainingMs() const {
        if (!deadline_active_) return 0U;
        const uint32_t elapsed = static_cast<uint32_t>(millis() - deadline_started_ms_);
        return elapsed >= deadline_duration_ms_ ? 0U : deadline_duration_ms_ - elapsed;
    }

    int connect(IPAddress ip, uint16_t port) override {
        const uint32_t remaining = remainingMs();
        return remaining == 0U ? 0 : WiFiClient::connect(ip, port, static_cast<int32_t>(remaining));
    }

    int connect(const char*, uint16_t) override { return 0; }

    int available() override {
        if (deadlineExpired()) { WiFiClient::stop(); return 0; }
        return WiFiClient::available();
    }

    int read() override {
        if (deadlineExpired()) { WiFiClient::stop(); return -1; }
        return WiFiClient::read();
    }

    int read(uint8_t* buffer, size_t size) override {
        if (deadlineExpired()) { WiFiClient::stop(); return -1; }
        return WiFiClient::read(buffer, size);
    }

    size_t write(uint8_t value) override {
        return write(&value, 1U);
    }

    size_t write(const uint8_t* buffer, size_t size) override {
        size_t sent = 0U;
        while (sent < size) {
            const uint32_t remaining = remainingMs();
            const int socket_fd = fd();
            if (remaining == 0U || socket_fd < 0) { WiFiClient::stop(); break; }
            fd_set writable;
            FD_ZERO(&writable);
            FD_SET(socket_fd, &writable);
            timeval timeout{static_cast<time_t>(remaining / 1000U), static_cast<suseconds_t>((remaining % 1000U) * 1000U)};
            const int ready = select(socket_fd + 1, nullptr, &writable, nullptr, &timeout);
            if (ready == 0) { WiFiClient::stop(); break; }
            if (ready < 0) {
                if (errno == EINTR) continue;
                WiFiClient::stop();
                break;
            }
            const int result = send(socket_fd, buffer + sent, size - sent, MSG_DONTWAIT);
            if (result > 0) sent += static_cast<size_t>(result);
            else if (result < 0 && (errno == EAGAIN || errno == EWOULDBLOCK || errno == EINTR)) continue;
            else { WiFiClient::stop(); break; }
        }
        return sent;
    }

    void flush() override {
        if (deadlineExpired()) WiFiClient::stop();
        else WiFiClient::flush();
    }

    void stop() override {
        deadline_active_ = false;
        WiFiClient::stop();
    }

    uint8_t connected() override {
        if (deadlineExpired()) { WiFiClient::stop(); return 0U; }
        return WiFiClient::connected();
    }

private:
    bool deadline_active_ = false;
    uint32_t deadline_started_ms_ = 0U;
    uint32_t deadline_duration_ms_ = 0U;
};

struct StoredConfig {
    uint32_t magic;
    uint16_t version;
    uint16_t mqtt_port;
    uint32_t sleep_minutes;
    char wifi_ssid[33];
    char wifi_password[64];
    char mqtt_host[129];
    char mqtt_username[65];
    char mqtt_password[129];
    char topic_prefix[97];
    uint32_t crc32;
};
static_assert(sizeof(StoredConfig) < 1024U, "configuration should remain a small NVS value");

enum class PromotionResult : uint8_t { Failed, Promoted, PromotedCleanupPending };

struct Reading {
    bool valid = false;
    uint8_t address = 0;
    bool spi = false;
    uint8_t spi_mode = 0;
    float temperature_c = NAN;
    float humidity_percent = NAN;
    float pressure_hpa = NAN;
};

