trip1/esp32-projects/firmware/bme280-mqtt-sensor/src/main.cpp
struct SensorScanReport {
    bool i2c_100_started = false;
    bool i2c_400_started = false;
    uint8_t i2c_addresses[16]{};
    bool i2c_seen[128]{};
    uint8_t i2c_address_count = 0;
    uint8_t i2c_device_count = 0;
    bool i2c_truncated = false;
    bool bme_i2c = false;
    uint8_t bme_i2c_address = 0;
    uint32_t bme_i2c_clock = 0;
    bool bme_spi = false;
    uint8_t bme_spi_mode = 0;
    bool spi_mode3_only_bme = false;
    uint8_t spi_mode0_chip_id = 0xffU;
    uint8_t spi_mode3_chip_id = 0xffU;
    uint8_t incompatible_chip_id = 0xffU;
    bool incompatible_over_spi = false;
    uint8_t incompatible_i2c_address = 0;
};

struct FormFields {
    char csrf[17]{};
    char wifi_ssid[33]{};
    char wifi_password[64]{};
    char mqtt_host[129]{};
    char mqtt_port[6]{};
    char mqtt_username[65]{};
    char mqtt_password[129]{};
    char topic_prefix[97]{};
    char sleep_minutes[5]{};
    uint16_t seen = 0;
};

constexpr uint16_t kFieldCsrf = 1U << 0U;
constexpr uint16_t kFieldSsid = 1U << 1U;
constexpr uint16_t kFieldWifiPassword = 1U << 2U;
constexpr uint16_t kFieldMqttHost = 1U << 3U;
constexpr uint16_t kFieldMqttPort = 1U << 4U;
constexpr uint16_t kFieldMqttUsername = 1U << 5U;
constexpr uint16_t kFieldMqttPassword = 1U << 6U;
constexpr uint16_t kFieldTopicPrefix = 1U << 7U;
constexpr uint16_t kFieldSleepMinutes = 1U << 8U;
constexpr uint16_t kRequiredFields = (1U << 9U) - 1U;

StoredConfig active_config{};
bool active_config_ready = false;
DNSServer dns;
WiFiServer provisioning_server(80);
DeadlineWiFiClient network;
PubSubClient mqtt(network);
bool provisioning = false;
uint32_t provisioning_started_ms = 0;
char csrf_token[17]{};
bool restart_requested = false;
SensorScanReport latest_scan{};
bool scan_ready = false;

struct PublishConfirmation {
    char topic[160]{};
    char payload[512]{};
    size_t payload_length = 0U;
    bool armed = false;
    bool received = false;
};

PublishConfirmation publish_confirmation{};

bool isTerminated(const char* value, size_t capacity) {
    return std::memchr(value, '\0', capacity) != nullptr;
}

uint32_t configChecksum(const StoredConfig& value) {
    return configurationCrc32(reinterpret_cast<const uint8_t*>(&value), offsetof(StoredConfig, crc32));
}

bool configIsValid(const StoredConfig& value) {
    if (value.magic != kConfigMagic || value.version != kConfigVersion || value.crc32 != configChecksum(value)) return false;
    if (!isTerminated(value.wifi_ssid, sizeof(value.wifi_ssid)) ||
        !isTerminated(value.wifi_password, sizeof(value.wifi_password)) ||
        !isTerminated(value.mqtt_host, sizeof(value.mqtt_host)) ||
        !isTerminated(value.mqtt_username, sizeof(value.mqtt_username)) ||
        !isTerminated(value.mqtt_password, sizeof(value.mqtt_password)) ||
        !isTerminated(value.topic_prefix, sizeof(value.topic_prefix))) return false;
    return isValidWifiSsid(value.wifi_ssid) &&
           isValidWifiPassword(value.wifi_password) &&
           isValidMqttHost(value.mqtt_host) &&
           isValidOptionalCredential(value.mqtt_username, sizeof(value.mqtt_username) - 1U) &&
           isValidOptionalCredential(value.mqtt_password, sizeof(value.mqtt_password) - 1U) &&
           !(value.mqtt_username[0] == '\0' && value.mqtt_password[0] != '\0') &&
           isValidTopicPrefix(value.topic_prefix) &&
           value.mqtt_port > 0U &&
           isValidSleepMinutes(value.sleep_minutes);
}

bool loadRecord(const char* key, StoredConfig& value) {
    Preferences preferences;
    if (!preferences.begin("bme280mqtt", true)) return false;
    const size_t length = preferences.getBytesLength(key);
    const size_t read = length == sizeof(value) ? preferences.getBytes(key, &value, sizeof(value)) : 0U;
    preferences.end();
    return read == sizeof(value) && configIsValid(value);
}

bool storeRecord(const char* key, const StoredConfig& value) {
    Preferences preferences;
    if (!preferences.begin("bme280mqtt", false)) return false;
    const bool stored = preferences.putBytes(key, &value, sizeof(value)) == sizeof(value);
    preferences.end();
    if (!stored) return false;
    StoredConfig verified{};
    return loadRecord(key, verified) && std::memcmp(&verified, &value, sizeof(value)) == 0;
}

bool removeRecord(const char* key) {
    Preferences preferences;
    if (!preferences.begin("bme280mqtt", false)) return false;
    const bool removed = !preferences.isKey(key) || preferences.remove(key);
    preferences.end();
    return removed;
}

bool clearConfiguration() {
    Preferences preferences;
    if (!preferences.begin("bme280mqtt", false)) return false;
    const bool cleared = preferences.clear();
    preferences.end();
    return cleared;
}

PromotionResult promotePending(const StoredConfig& pending) {
    if (!storeRecord("active", pending)) return PromotionResult::Failed;
    return removeRecord("pending") ? PromotionResult::Promoted : PromotionResult::PromotedCleanupPending;
}

template <size_t N>
bool copyText(const char* source, size_t length, char (&destination)[N]) {
    if (length >= N) return false;
    std::memcpy(destination, source, length);
    destination[length] = '\0';
    return true;
}

bool parseUnsigned(const char* value, uint32_t maximum, uint32_t& output) {
    if (value == nullptr || *value == '\0') return false;
    char* end = nullptr;
    const unsigned long parsed = std::strtoul(value, &end, 10);
    if (end == value || *end != '\0' || parsed > maximum) return false;
    output = static_cast<uint32_t>(parsed);
    return true;
}

int hexValue(char value) {
    if (value >= '0' && value <= '9') return value - '0';
    if (value >= 'a' && value <= 'f') return value - 'a' + 10;
    if (value >= 'A' && value <= 'F') return value - 'A' + 10;
    return -1;
}

template <size_t N>
bool decodeFormValue(const char* begin, const char* end, char (&output)[N]) {
    size_t used = 0;
    while (begin < end) {
        char value = *begin++;
        if (value == '+') value = ' ';
        else if (value == '%') {
            if (end - begin < 2) return false;
            const int high = hexValue(begin[0]);
            const int low = hexValue(begin[1]);
            if (high < 0 || low < 0) return false;
            value = static_cast<char>((high << 4) | low);
            begin += 2;
        }
        if (value == '\0' || used + 1U >= N) return false;
        output[used++] = value;
    }
    output[used] = '\0';
    return true;
}

bool assignFormField(const char* key_begin, const char* key_end, const char* value_begin, const char* value_end, FormFields& fields) {
    const std::string key(key_begin, key_end);
    uint16_t bit = 0;
    bool decoded = false;
    if (key == "csrf") { bit = kFieldCsrf; decoded = decodeFormValue(value_begin, value_end, fields.csrf); }
    else if (key == "ssid") { bit = kFieldSsid; decoded = decodeFormValue(value_begin, value_end, fields.wifi_ssid); }
    else if (key == "wifi_password") { bit = kFieldWifiPassword; decoded = decodeFormValue(value_begin, value_end, fields.wifi_password); }
    else if (key == "mqtt_host") { bit = kFieldMqttHost; decoded = decodeFormValue(value_begin, value_end, fields.mqtt_host); }
    else if (key == "mqtt_port") { bit = kFieldMqttPort; decoded = decodeFormValue(value_begin, value_end, fields.mqtt_port); }
    else if (key == "mqtt_username") { bit = kFieldMqttUsername; decoded = decodeFormValue(value_begin, value_end, fields.mqtt_username); }
    else if (key == "mqtt_password") { bit = kFieldMqttPassword; decoded = decodeFormValue(value_begin, value_end, fields.mqtt_password); }
    else if (key == "topic_prefix") { bit = kFieldTopicPrefix; decoded = decodeFormValue(value_begin, value_end, fields.topic_prefix); }
    else if (key == "sleep_minutes") { bit = kFieldSleepMinutes; decoded = decodeFormValue(value_begin, value_end, fields.sleep_minutes); }
    else return false;
    if (!decoded || (fields.seen & bit) != 0U) return false;
    fields.seen |= bit;
    return true;
}

bool parseForm(const char* body, size_t length, FormFields& fields) {
    const char* cursor = body;
    const char* end = body + length;
    unsigned count = 0;
    while (cursor < end && count++ < 9U) {
        const char* pair_end = static_cast<const char*>(std::memchr(cursor, '&', end - cursor));
        if (pair_end == nullptr) pair_end = end;
        const char* equals = static_cast<const char*>(std::memchr(cursor, '=', pair_end - cursor));
        if (equals == nullptr || !assignFormField(cursor, equals, equals + 1, pair_end, fields)) return false;
        cursor = pair_end < end ? pair_end + 1 : end;
    }
    return cursor == end && fields.seen == kRequiredFields;
}

