trip1/esp32-projects/firmware/bme280-mqtt-sensor/src/main.cpp
bool validCsrfBody(const char* body, size_t length) {
    static constexpr char prefix[] = "csrf=";
    if (length <= sizeof(prefix) - 1U || std::memcmp(body, prefix, sizeof(prefix) - 1U) != 0) return false;
    char decoded[17]{};
    return decodeFormValue(body + sizeof(prefix) - 1U, body + length, decoded) &&
           std::strcmp(decoded, csrf_token) == 0;
}

void rememberI2cAddress(SensorScanReport& report, uint8_t address) {
    if (report.i2c_seen[address]) return;
    report.i2c_seen[address] = true;
    if (report.i2c_address_count < sizeof(report.i2c_addresses)) {
        report.i2c_addresses[report.i2c_address_count++] = address;
    } else report.i2c_truncated = true;
    if (report.i2c_device_count < 0xffU) ++report.i2c_device_count;
}

uint8_t readI2cChipId(uint8_t address) {
    Wire.beginTransmission(address);
    Wire.write(0xd0U);
    if (Wire.endTransmission(false) != 0U || Wire.requestFrom(address, static_cast<uint8_t>(1U)) != 1U) return 0xffU;
    return static_cast<uint8_t>(Wire.read());
}

void scanI2cClock(SensorScanReport& report, uint32_t clock_hz) {
    if (!Wire.begin(SENSOR_SDA_PIN, SENSOR_SCL_PIN, clock_hz)) return;
    if (clock_hz == 100000U) report.i2c_100_started = true;
    if (clock_hz == 400000U) report.i2c_400_started = true;
    Wire.setTimeOut(10U);
    for (uint8_t address = 1U; address < 127U; ++address) {
        Wire.beginTransmission(address);
        if (Wire.endTransmission() != 0U) continue;
        rememberI2cAddress(report, address);
        if (address != 0x76U && address != 0x77U) continue;
        const uint8_t chip_id = readI2cChipId(address);
        const EnvironmentalSensorChip chip = classifyEnvironmentalSensorChip(chip_id);
        if (chip == EnvironmentalSensorChip::Bme280 && !report.bme_i2c) {
            report.bme_i2c = true;
            report.bme_i2c_address = address;
            report.bme_i2c_clock = clock_hz;
        } else if (chip == EnvironmentalSensorChip::Bmp280 && report.incompatible_chip_id == 0xffU) {
            report.incompatible_chip_id = chip_id;
            report.incompatible_i2c_address = address;
        }
    }
    Wire.end();
}

uint8_t readSpiChipId(uint8_t mode) {
    SPI.beginTransaction(SPISettings(1000000U, MSBFIRST, mode));
    digitalWrite(SENSOR_SPI_CS_PIN, LOW);
    delayMicroseconds(2U);
    SPI.transfer(0xd0U);
    const uint8_t chip_id = SPI.transfer(0x00U);
    digitalWrite(SENSOR_SPI_CS_PIN, HIGH);
    SPI.endTransaction();
    return chip_id;
}

uint8_t readStableSpiChipId(uint8_t mode) {
    const uint8_t first = readSpiChipId(mode);
    const uint8_t second = readSpiChipId(mode);
    const uint8_t third = readSpiChipId(mode);
    return first == second && second == third ? first : 0xffU;
}

SensorScanReport scanSensorBuses() {
    SensorScanReport report;
    pinMode(SENSOR_SPI_CS_PIN, OUTPUT);
    digitalWrite(SENSOR_SPI_CS_PIN, HIGH);
    scanI2cClock(report, 100000U);
    scanI2cClock(report, 400000U);

    SPI.begin(SENSOR_SPI_SCK_PIN, SENSOR_SPI_MISO_PIN, SENSOR_SPI_MOSI_PIN, SENSOR_SPI_CS_PIN);
    report.spi_mode0_chip_id = readStableSpiChipId(SPI_MODE0);
    report.spi_mode3_chip_id = readStableSpiChipId(SPI_MODE3);
    if (classifyEnvironmentalSensorChip(report.spi_mode0_chip_id) == EnvironmentalSensorChip::Bme280) {
        report.bme_spi = true;
        report.bme_spi_mode = 0U;
    } else if (classifyEnvironmentalSensorChip(report.spi_mode3_chip_id) == EnvironmentalSensorChip::Bme280) {
        report.spi_mode3_only_bme = true;
    } else if (report.incompatible_chip_id == 0xffU) {
        if (classifyEnvironmentalSensorChip(report.spi_mode0_chip_id) == EnvironmentalSensorChip::Bmp280) {
            report.incompatible_chip_id = report.spi_mode0_chip_id;
            report.incompatible_over_spi = true;
        } else if (classifyEnvironmentalSensorChip(report.spi_mode3_chip_id) == EnvironmentalSensorChip::Bmp280) {
            report.incompatible_chip_id = report.spi_mode3_chip_id;
            report.incompatible_over_spi = true;
        }
    }
    SPI.end();
    Serial.printf("Sensor scan: I2C devices=%u, BME280 I2C=%s, BME280 SPI=%s\n",
                  report.i2c_device_count, report.bme_i2c ? "yes" : "no", report.bme_spi ? "yes" : "no");
    return report;
}

void appendScanReport(String& page) {
    page += F("<section class=scan><h2>Sensor preflight</h2>");
    if (!scan_ready) {
        page += F("<p class=bad>Scan has not completed.</p>");
    } else if (latest_scan.bme_i2c) {
        char found[128];
        std::snprintf(found, sizeof(found), "<p class=good>BME280 detected over I&sup2;C at <code>0x%02X</code> (%lu kHz).</p>",
                      latest_scan.bme_i2c_address, static_cast<unsigned long>(latest_scan.bme_i2c_clock / 1000U));
        page += found;
    } else if (latest_scan.bme_spi) {
        char found[112];
        std::snprintf(found, sizeof(found), "<p class=good>BME280 detected over four-wire SPI (mode %u).</p>", latest_scan.bme_spi_mode);
        page += found;
    } else if (latest_scan.spi_mode3_only_bme) {
        page += F("<p class=bad>A BME280 chip ID responded only in SPI mode 3. Runtime sampling requires a confirmed mode-0 response; check CS, SCK, MOSI, MISO, power, and ground.</p>");
    } else if (latest_scan.incompatible_chip_id != 0xffU) {
        char found[192];
        if (latest_scan.incompatible_over_spi) {
            std::snprintf(found, sizeof(found), "<p class=bad>%s detected over SPI (chip ID <code>0x%02X</code>), not a BME280.</p>",
                          environmentalSensorChipName(latest_scan.incompatible_chip_id), latest_scan.incompatible_chip_id);
        } else {
            std::snprintf(found, sizeof(found), "<p class=bad>%s detected at I&sup2;C <code>0x%02X</code> (chip ID <code>0x%02X</code>), not a BME280.</p>",
                          environmentalSensorChipName(latest_scan.incompatible_chip_id), latest_scan.incompatible_i2c_address,
                          latest_scan.incompatible_chip_id);
        }
        page += found;
    } else {
        page += F("<p class=bad>No BME280 detected. Fix power and wiring, then scan again before entering network settings.</p>");
    }
    page += F("<p><strong>I&sup2;C:</strong> attempted every address <code>0x01-0x7E</code> at 100 and 400 kHz on SDA GPIO");
    page += String(SENSOR_SDA_PIN);
    page += F(" / SCL GPIO");
    page += String(SENSOR_SCL_PIN);
    page += F(". Controller status: 100 kHz ");
    page += latest_scan.i2c_100_started ? F("ready") : F("failed");
    page += F(", 400 kHz ");
    page += latest_scan.i2c_400_started ? F("ready") : F("failed");
    page += F(". Responding addresses: ");
    page += String(latest_scan.i2c_device_count);
    page += F(". First addresses: ");
    if (latest_scan.i2c_address_count == 0U) page += F("none");
    for (uint8_t index = 0; index < latest_scan.i2c_address_count; ++index) {
        char address[8];
        std::snprintf(address, sizeof(address), "%s0x%02X", index == 0U ? "" : ", ", latest_scan.i2c_addresses[index]);
        page += address;
    }
    if (latest_scan.i2c_truncated) page += F(", more not shown");
    page += F(".</p><p><strong>SPI:</strong> probed four-wire modes 0 and 3 at 1 MHz on SCK GPIO");
    page += String(SENSOR_SPI_SCK_PIN);
    page += F(", MISO GPIO");
    page += String(SENSOR_SPI_MISO_PIN);
    page += F(", MOSI GPIO");
    page += String(SENSOR_SPI_MOSI_PIN);
    page += F(", CS GPIO");
    page += String(SENSOR_SPI_CS_PIN);
    page += F(". SPI has no address discovery; the probe reads the Bosch chip-ID register on this exact CS pin.</p><form method=post action=/scan><input type=hidden name=csrf value='");
    page += csrf_token;
    page += F("'><button type=submit>Scan sensor buses again</button></form></section>");
}

