trip1/esp32-projects/firmware/bme280-mqtt-sensor/src/main.cpp
String setupPage(const String& message = String()) {
    String page;
    page.reserve(6500);
    page += F("<!doctype html><html><head><meta charset=utf-8><meta name=viewport content='width=device-width,initial-scale=1'><title>BME280 Setup</title><style>body{margin:0;background:#0b1014;color:#eef5f0;font:16px/1.5 system-ui,sans-serif}main{max-width:680px;margin:auto;padding:28px 18px}h1{font-size:42px;line-height:1}h2{margin-top:0}label{display:grid;gap:5px;margin:14px 0;color:#b7c3be}input{min-height:46px;padding:0 12px;border:1px solid #3b4a51;border-radius:5px;background:#172127;color:#fff;font:inherit}button{min-height:46px;padding:0 16px;border:0;border-radius:5px;background:#a7f46a;color:#10200a;font-weight:700}.warn,.message,.scan{padding:14px;border:1px solid #765f38;background:#211c13}.message{border-color:#a7f46a}.scan{margin:20px 0;border-color:#3b4a51;background:#111a20}.good,.bad{padding:12px;font-weight:700}.good{border:1px solid #4f8b68;background:#11251a;color:#bff4d0}.bad{border:1px solid #a95c4c;background:#2a1714;color:#ffd5cc}.muted{color:#9caaa5}code{color:#a7f46a}</style></head><body><main><p class=muted>ESP32 · PROTECTED PROVISIONING</p><h1>BME280 MQTT Sensor</h1>");
    if (!message.isEmpty()) page += "<p class=message>" + message + "</p>";
    appendScanReport(page);
    page += F("<p class=warn>This temporary setup network uses the random password printed on USB serial. Wi-Fi and MQTT passwords are stored in ESP32 NVS and are not encrypted at rest.</p><form method=post action=/save><input type=hidden name=csrf value='");
    page += csrf_token;
    page += F("'><label>Wi-Fi SSID<input name=ssid maxlength=32 required autocomplete=off></label><label>Wi-Fi password<input name=wifi_password type=password maxlength=63 autocomplete=new-password></label><label>MQTT broker IPv4 address<input name=mqtt_host maxlength=15 required placeholder=192.168.1.10></label><label>MQTT port<input name=mqtt_port type=number min=1 max=65535 value=1883 required></label><label>MQTT username<input name=mqtt_username maxlength=64 autocomplete=off></label><label>MQTT password<input name=mqtt_password type=password maxlength=128 autocomplete=new-password></label><label>Topic prefix<input name=topic_prefix maxlength=96 value=home/environment required></label><label>Wake interval (minutes)<input name=sleep_minutes type=number min=1 max=1440 value=5 required></label><button type=submit>Save pending configuration</button></form><p class=muted>The sensor waits for a stable Wi-Fi address, then tests pending MQTT settings with a nonce-bearing round trip. The broker account must be allowed to publish and subscribe to the device state topic. Pending settings are promoted only after confirmed delivery; the previous active configuration is preserved on failure.</p><form method=post action=/clear><input type=hidden name=csrf value='");
    page += csrf_token;
    page += F("'><button type=submit>Erase saved configuration</button></form></main></body></html>");
    return page;
}

void sendHttp(WiFiClient& client, int status, const char* reason, const String& body) {
    client.printf("HTTP/1.1 %d %s\r\nContent-Type: text/html; charset=utf-8\r\nContent-Length: %u\r\nConnection: close\r\nCache-Control: no-store\r\n\r\n",
                  status, reason, static_cast<unsigned>(body.length()));
    client.print(body);
}

bool createCandidate(const FormFields& fields, StoredConfig& candidate) {
    uint32_t port = 0;
    uint32_t sleep_minutes = 0;
    if (!parseUnsigned(fields.mqtt_port, 65535U, port) || !parseUnsigned(fields.sleep_minutes, 1440U, sleep_minutes)) return false;
    candidate = {};
    candidate.magic = kConfigMagic;
    candidate.version = kConfigVersion;
    candidate.mqtt_port = static_cast<uint16_t>(port);
    candidate.sleep_minutes = sleep_minutes;
    if (!copyText(fields.wifi_ssid, std::strlen(fields.wifi_ssid), candidate.wifi_ssid) ||
        !copyText(fields.wifi_password, std::strlen(fields.wifi_password), candidate.wifi_password) ||
        !copyText(fields.mqtt_host, std::strlen(fields.mqtt_host), candidate.mqtt_host) ||
        !copyText(fields.mqtt_username, std::strlen(fields.mqtt_username), candidate.mqtt_username) ||
        !copyText(fields.mqtt_password, std::strlen(fields.mqtt_password), candidate.mqtt_password) ||
        !copyText(fields.topic_prefix, std::strlen(fields.topic_prefix), candidate.topic_prefix)) return false;
    candidate.crc32 = configChecksum(candidate);
    return configIsValid(candidate);
}

void handlePost(WiFiClient& client, const char* path, const char* body, size_t body_length) {
    if (std::strcmp(path, "/scan") == 0) {
        if (!validCsrfBody(body, body_length)) {
            sendHttp(client, 400, "Bad Request", setupPage("Scan request rejected."));
        } else {
            latest_scan = scanSensorBuses();
            scan_ready = true;
            sendHttp(client, 200, "OK", setupPage("Sensor buses scanned again."));
        }
        return;
    }
    if (std::strcmp(path, "/clear") == 0) {
        if (!validCsrfBody(body, body_length)) {
            sendHttp(client, 400, "Bad Request", setupPage("Request rejected."));
        } else if (!clearConfiguration()) {
            sendHttp(client, 503, "Unavailable", setupPage("NVS clear failed."));
        } else {
            sendHttp(client, 200, "OK", setupPage("Configuration erased. Restarting into setup."));
            active_config_ready = false;
            rejected_pending_marker = 0U;
            restart_requested = true;
        }
        return;
    }
    FormFields fields{};
    if (!parseForm(body, body_length, fields) || std::strcmp(fields.csrf, csrf_token) != 0) {
        sendHttp(client, 400, "Bad Request", setupPage("Request rejected."));
        return;
    }
    if (std::strcmp(path, "/save") != 0) {
        sendHttp(client, 404, "Not Found", setupPage());
        return;
    }
    StoredConfig candidate{};
    if (!createCandidate(fields, candidate)) {
        sendHttp(client, 400, "Bad Request", setupPage("Check the SSID, password lengths, numeric MQTT IPv4 address, topic prefix, and wake interval."));
        return;
    }
    if (!storeRecord("pending", candidate)) {
        sendHttp(client, 503, "Unavailable", setupPage("NVS write or verification failed; active settings were preserved."));
        return;
    }
    sendHttp(client, 200, "OK", setupPage("Pending settings saved. Restarting to test them."));
    rejected_pending_marker = 0U;
    restart_requested = true;
}

bool readHttpRequest(WiFiClient& client, char* request, size_t capacity, size_t& used, size_t& header_end,
                     size_t& content_length, char* method, size_t method_capacity, char* path, size_t path_capacity) {
    const uint32_t started = millis();
    header_end = 0;
    content_length = 0;
    while (client.connected() && static_cast<uint32_t>(millis() - started) < 2000U) {
        while (client.available()) {
            if (used + 1U >= capacity) return false;
            request[used++] = static_cast<char>(client.read());
            request[used] = '\0';
            if (header_end == 0U && used >= 4U && std::memcmp(request + used - 4U, "\r\n\r\n", 4U) == 0) {
                header_end = used;
                if (header_end > kMaximumHeaderBytes) return false;
                bool has_content_length = false;
                if (!parseBoundedHttpRequest(request, header_end, kMaximumBodyBytes,
                        method, method_capacity, path, path_capacity, content_length, has_content_length)) return false;

