trip1/esp32-projects/firmware/bme280-mqtt-sensor/src/main.cpp
            }
            if (header_end != 0U && used >= header_end + content_length) return true;
        }
        delay(1);
    }
    return header_end != 0U && used >= header_end + content_length;
}

void handleProvisioningClient() {
    WiFiClient client = provisioning_server.accept();
    if (!client) return;
    char request[kMaximumRequestBytes + 1U]{};
    size_t used = 0;
    size_t header_end = 0;
    size_t content_length = 0;
    char method[8]{};
    char path[64]{};
    if (!readHttpRequest(client, request, sizeof(request), used, header_end, content_length,
                         method, sizeof(method), path, sizeof(path))) {
        sendHttp(client, 413, "Payload Too Large", setupPage("Request too large or incomplete."));
        client.stop();
        return;
    }
    if (std::strcmp(method, "GET") == 0) {
        sendHttp(client, 200, "OK", setupPage());
    } else if (std::strcmp(method, "POST") == 0 && content_length > 0U) {
        handlePost(client, path, request + header_end, content_length);
    } else {
        sendHttp(client, 405, "Method Not Allowed", setupPage());
    }
    delay(1);
    client.stop();
}

void makeRandomHex(char* output, size_t bytes) {
    static constexpr char hex[] = "0123456789abcdef";
    for (size_t index = 0; index < bytes; ++index) {
        const uint8_t value = static_cast<uint8_t>(esp_random());
        output[index * 2U] = hex[value >> 4U];
        output[index * 2U + 1U] = hex[value & 0x0fU];
    }
    output[bytes * 2U] = '\0';
}

template <size_t N>
void makeReadableSetupPassword(char (&output)[N]) {
    static_assert(N >= kSetupPasswordCharacters + 1U, "setup password buffer is too small");
    for (size_t index = 0; index < kSetupPasswordCharacters; ++index) {
        output[index] = kSetupPasswordAlphabet[esp_random() & 31U];
    }
    output[kSetupPasswordCharacters] = '\0';
}

void startProvisioning() {
    uint8_t mac[6]{};
    esp_read_mac(mac, ESP_MAC_WIFI_STA);
    char ssid[32];
    char password[kSetupPasswordCharacters + 1U];
    std::snprintf(ssid, sizeof(ssid), "BME280-Setup-%02X%02X%02X", mac[3], mac[4], mac[5]);
    WiFi.mode(WIFI_AP);
    makeReadableSetupPassword(password);
    makeRandomHex(csrf_token, 8U);
    latest_scan = scanSensorBuses();
    scan_ready = true;
    if (!WiFi.softAP(ssid, password, 1, false, 1)) {
        Serial.println("Provisioning AP failed; entering fail-safe sleep");
        return;
    }
    if (!dns.start(53, "*", WiFi.softAPIP())) {
        Serial.println("Provisioning DNS failed; entering fail-safe sleep");
        WiFi.softAPdisconnect(true);
        return;
    }
    provisioning_server.begin();
    provisioning = true;
    provisioning_started_ms = millis();
    Serial.printf("Provisioning: join %s with password %s, then open http://%s\n",
                  ssid, password, WiFi.softAPIP().toString().c_str());
}

bool takeReading(Adafruit_BME280& sensor, Reading& reading) {
    sensor.setSampling(Adafruit_BME280::MODE_FORCED, Adafruit_BME280::SAMPLING_X1,
                       Adafruit_BME280::SAMPLING_X1, Adafruit_BME280::SAMPLING_X1,
                       Adafruit_BME280::FILTER_OFF, Adafruit_BME280::STANDBY_MS_0_5);
    if (!sensor.takeForcedMeasurement()) return false;
    reading.temperature_c = sensor.readTemperature();
    reading.humidity_percent = sensor.readHumidity();
    reading.pressure_hpa = sensor.readPressure() / 100.0F;
    reading.valid = isValidBme280Reading(reading.temperature_c, reading.humidity_percent, reading.pressure_hpa);
    return reading.valid;
}

Reading readSensorHardware() {
    Reading reading;
    const SensorScanReport scan = scanSensorBuses();
    if (scan.bme_i2c) {
        if (!Wire.begin(SENSOR_SDA_PIN, SENSOR_SCL_PIN, scan.bme_i2c_clock)) {
            Serial.println("I2C initialization failed after detection");
            return reading;
        }
        Wire.setTimeOut(20U);
        Adafruit_BME280 sensor;
        if (!sensor.begin(scan.bme_i2c_address, &Wire)) {
            Serial.println("BME280 disappeared from I2C after detection");
            Wire.end();
            return reading;
        }
        reading.address = scan.bme_i2c_address;
        takeReading(sensor, reading);
        Wire.end();
        return reading;
    }
    if (scan.bme_spi) {
        pinMode(SENSOR_SPI_CS_PIN, OUTPUT);
        digitalWrite(SENSOR_SPI_CS_PIN, HIGH);
        SPI.begin(SENSOR_SPI_SCK_PIN, SENSOR_SPI_MISO_PIN, SENSOR_SPI_MOSI_PIN, SENSOR_SPI_CS_PIN);
        Adafruit_BME280 sensor(SENSOR_SPI_CS_PIN, &SPI);
        if (!sensor.begin()) {
            Serial.println("BME280 disappeared from SPI after detection");
            SPI.end();
            return reading;
        }
        reading.spi = true;
        reading.spi_mode = 0U;
        takeReading(sensor, reading);
        SPI.end();
        return reading;
    }
    if (scan.incompatible_chip_id != 0xffU) {
        Serial.printf("Found %s (chip ID 0x%02X), not a BME280\n",
                      environmentalSensorChipName(scan.incompatible_chip_id), scan.incompatible_chip_id);
    } else Serial.println("BME280 not found on scanned I2C or four-wire SPI buses");
    return reading;
}

void sensorReadTask(void* parameter) {
    QueueHandle_t queue = static_cast<QueueHandle_t>(parameter);
    const Reading reading = readSensorHardware();
    xQueueSend(queue, &reading, 0U);
    vTaskSuspend(nullptr);
}

Reading readSensorBounded() {
    Reading reading;
    QueueHandle_t queue = xQueueCreate(1U, sizeof(Reading));
    if (queue == nullptr) {
        Serial.println("Sensor read queue allocation failed");
        return reading;
    }
    TaskHandle_t task = nullptr;
    const BaseType_t created = xTaskCreate(sensorReadTask, "bme280-read", 8192U, queue, 1U, &task);
    if (created != pdPASS || task == nullptr) {
        Serial.println("Sensor read task allocation failed");
        vQueueDelete(queue);
        return reading;
    }
    if (xQueueReceive(queue, &reading, pdMS_TO_TICKS(kSensorReadTimeoutMs)) != pdTRUE) {
        Serial.println("Sensor initialization timed out; continuing to bounded network attempt and sleep");
        reading = {};
    }
    vTaskDelete(task);
    vQueueDelete(queue);
    return reading;
}

void mqttMessageCallback(char* topic, uint8_t* payload, unsigned int length) {
    if (!publish_confirmation.armed || publish_confirmation.received) return;
    publish_confirmation.received = mqttDeliveryMatches(
        publish_confirmation.topic, publish_confirmation.payload, publish_confirmation.payload_length,
        topic, payload, static_cast<size_t>(length));
}

bool connectWifi(const StoredConfig& value) {
    WiFi.persistent(false);
    WiFi.mode(WIFI_STA);
    WiFi.begin(value.wifi_ssid, value.wifi_password);
    const uint32_t started = millis();
    uint32_t ready_since = 0U;
    bool ready_started = false;
    IPAddress ready_ip(0U, 0U, 0U, 0U);
    while (static_cast<uint32_t>(millis() - started) < kWifiTimeoutMs) {
        const IPAddress current_ip = WiFi.localIP();
        const bool ready = WiFi.status() == WL_CONNECTED && current_ip != IPAddress(0U, 0U, 0U, 0U);
        if (ready) {
            if (!ready_started || current_ip != ready_ip) {
                ready_started = true;
                ready_since = millis();
                ready_ip = current_ip;
            } else if (static_cast<uint32_t>(millis() - ready_since) >= kWifiStableMs) {
                Serial.printf("Wi-Fi ready: %s, RSSI %d dBm\n", WiFi.localIP().toString().c_str(), WiFi.RSSI());
                return true;
            }
        } else {
            ready_started = false;
            ready_since = 0U;
        }
        delay(100);
    }
    Serial.printf("Wi-Fi connection timed out after %lu ms (status %d)\n",
                  static_cast<unsigned long>(kWifiTimeoutMs), static_cast<int>(WiFi.status()));
    return false;
}

const char* chipPrefix() {
#if defined(CONFIG_IDF_TARGET_ESP32C6)
    return "esp32c6";
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
    return "esp32c3";
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
    return "esp32s3";
#else
    return "esp32";
#endif
}

