trip1/esp32-projects/firmware/bme280-mqtt-sensor/src/main.cpp
bool publishReadingOnce(const Reading& reading, const StoredConfig& value, bool retained) {
    uint8_t mac[6]{};
    esp_read_mac(mac, ESP_MAC_WIFI_STA);
    char device_id[32];
    std::snprintf(device_id, sizeof(device_id), "%s-bme280-%02x%02x%02x%02x%02x%02x", chipPrefix(), mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    char topic[160];
    const int topic_length = std::snprintf(topic, sizeof(topic), "%s/%s/state", value.topic_prefix, device_id);
    if (topic_length <= 0 || static_cast<size_t>(topic_length) >= sizeof(topic)) return false;

    char delivery_id[17];
    makeRandomHex(delivery_id, 8U);
    JsonDocument document;
    document["device_id"] = device_id;
    document["delivery_id"] = delivery_id;
    document["sensor"] = "BME280";
    document["valid"] = reading.valid;
    if (reading.valid) {
        document["temperature_c"] = std::round(reading.temperature_c * 100.0F) / 100.0F;
        document["humidity_percent"] = std::round(reading.humidity_percent * 100.0F) / 100.0F;
        document["pressure_hpa"] = std::round(reading.pressure_hpa * 100.0F) / 100.0F;
        if (reading.spi) {
            document["interface"] = "spi";
            document["spi_mode"] = reading.spi_mode;
            document["spi_cs_gpio"] = SENSOR_SPI_CS_PIN;
        } else {
            document["interface"] = "i2c";
            char address[5];
            std::snprintf(address, sizeof(address), "0x%02X", reading.address);
            document["i2c_address"] = address;
        }
    } else document["error"] = "bme280_read_failed";
    document["wifi_rssi_dbm"] = WiFi.RSSI();
    document["sleep_minutes"] = value.sleep_minutes;
    document["awake_ms"] = millis();
    char payload[512];
    const size_t length = serializeJson(document, payload, sizeof(payload));
    if (length == 0U || length >= sizeof(payload)) return false;

    IPAddress broker_ip;
    if (!broker_ip.fromString(value.mqtt_host)) {
        Serial.println("MQTT broker must be a numeric IPv4 address");
        return false;
    }
    mqtt.setServer(broker_ip, value.mqtt_port);
    mqtt.setCallback(mqttMessageCallback);
    if (!mqtt.setBufferSize(768)) return false;
    mqtt.setSocketTimeout(1);
    network.setConnectionTimeout(5000);
    network.setTimeout(1000);
    network.startDeadline(kMqttConnectDeadlineMs);
    const bool connected = value.mqtt_username[0] == '\0' ? mqtt.connect(device_id) : mqtt.connect(device_id, value.mqtt_username, value.mqtt_password);
    if (!connected) {
        Serial.printf("MQTT connection failed (state %d)\n", mqtt.state());
        network.stop();
        return false;
    }

    network.startDeadline(kMqttConfirmationTimeoutMs);

    publish_confirmation = {};
    std::memcpy(publish_confirmation.topic, topic, static_cast<size_t>(topic_length) + 1U);
    std::memcpy(publish_confirmation.payload, payload, length);
    publish_confirmation.payload[length] = '\0';
    publish_confirmation.payload_length = length;
    publish_confirmation.armed = true;

    const bool subscribed = mqtt.subscribe(topic, 0U);
    const bool queued = subscribed && mqtt.publish(topic, payload, retained);
    if (!subscribed) Serial.println("MQTT confirmation subscription failed");
    else if (!queued) Serial.println("MQTT publication could not be queued");
    const uint32_t confirmation_started = millis();
    while (queued && mqtt.connected() && !publish_confirmation.received &&
           static_cast<uint32_t>(millis() - confirmation_started) < kMqttConfirmationTimeoutMs) {
        mqtt.loop();
        delay(10);
    }
    const bool confirmed = queued && publish_confirmation.received;
    publish_confirmation.armed = false;
    if (confirmed) Serial.printf("MQTT delivery confirmed on %s\n", topic);
    else Serial.printf("MQTT delivery was not confirmed within %lu ms\n", static_cast<unsigned long>(kMqttConfirmationTimeoutMs));
    mqtt.disconnect();
    network.stop();
    return confirmed;
}

bool publishReading(const Reading& reading, const StoredConfig& value, bool retained) {
    for (uint8_t attempt = 1U; attempt <= kMqttPublishAttempts; ++attempt) {
        if (WiFi.status() != WL_CONNECTED || WiFi.localIP() == IPAddress(0U, 0U, 0U, 0U)) {
            Serial.println("Wi-Fi was lost before MQTT publication");
            return false;
        }
        Serial.printf("MQTT confirmed-delivery attempt %u of %u\n", attempt, kMqttPublishAttempts);
        if (publishReadingOnce(reading, value, retained)) return true;
        if (attempt < kMqttPublishAttempts) delay(kMqttRetryDelayMs);
    }
    Serial.println("MQTT delivery failed after all bounded attempts");
    return false;
}

[[noreturn]] void sleepForMinutes(uint32_t minutes) {
    provisioning_server.stop();
    dns.stop();
    WiFi.disconnect(true, false);
    const uint64_t sleep_us = static_cast<uint64_t>(minutes) * 60ULL * 1000000ULL;
    if (esp_sleep_enable_timer_wakeup(sleep_us) != ESP_OK) {
        Serial.println("Timer wakeup failed; entering indefinite deep sleep for battery safety");
        esp_sleep_disable_wakeup_source(ESP_SLEEP_WAKEUP_ALL);
    } else Serial.printf("Deep sleeping for %lu minute(s)\n", static_cast<unsigned long>(minutes));
    Serial.flush();
    while (true) {
        esp_deep_sleep_start();
        delay(1000);
    }
}

bool recoveryRequested() {
    if (esp_reset_reason() == ESP_RST_DEEPSLEEP) return false;
    Serial.println("Hold BOOT now for two seconds to open setup");
    const uint32_t started = millis();
    uint32_t held_since = 0;
    while (static_cast<uint32_t>(millis() - started) < kRecoveryWindowMs) {
        if (digitalRead(SETUP_BUTTON_PIN) == LOW) {
            if (held_since == 0U) held_since = millis();
            if (static_cast<uint32_t>(millis() - held_since) >= kRecoveryHoldMs) return true;
        } else held_since = 0;
        delay(10);
    }
    return false;
}

void processConfiguredWake(const StoredConfig& value, bool pending) {
    const Reading reading = readSensorBounded();
    const bool wifi_ready = connectWifi(value);
    const bool published = wifi_ready && publishReading(reading, value, !pending);
    bool promoted = !pending;
    if (pending) {
        const PromotionResult promotion = published ? promotePending(value) : PromotionResult::Failed;
        if (promotion != PromotionResult::Failed) {
            Serial.println("Pending configuration verified and promoted");
            if (promotion == PromotionResult::PromotedCleanupPending) {
                Serial.println("Pending cleanup failed; active configuration is authoritative and cleanup will retry after reboot");
            }
            active_config = value;
            active_config_ready = true;
            promoted = true;
            if (!publishReading(reading, value, true)) {
                Serial.println("Configuration promoted, but retained operational publication failed");
            }
        } else {
            Serial.println("Pending configuration failed; preserving active configuration");
            rejected_pending_marker = removeRecord("pending") ? 0U : kRejectedPendingMarker;
            if (rejected_pending_marker != 0U) Serial.println("Pending cleanup failed; ignoring it until replacement or cold boot");
        }
    }
    const uint32_t sleep_minutes = sleepMinutesAfterPendingAttempt(
        pending, published, promoted, active_config_ready, value.sleep_minutes,
        active_config.sleep_minutes, kFallbackSleepMinutes);
    sleepForMinutes(sleep_minutes);
}
}  // namespace

void setup() {
    Serial.begin(115200);
    delay(200);
    pinMode(SETUP_BUTTON_PIN, INPUT_PULLUP);
    active_config_ready = loadRecord("active", active_config);
    StoredConfig pending{};
    const bool pending_record_valid = loadRecord("pending", pending);
    const bool pending_matches_active = pending_record_valid && active_config_ready &&
        std::memcmp(&pending, &active_config, sizeof(pending)) == 0;
    const bool pending_ready = shouldProcessPending(
        pending_record_valid && !pending_matches_active, rejected_pending_marker == kRejectedPendingMarker);
    if (!pending_record_valid) {
        if (removeRecord("pending")) rejected_pending_marker = 0U;
    } else if (pending_matches_active && !removeRecord("pending")) {
        Serial.println("Already-promoted pending record could not be removed; active configuration remains authoritative");
    }
    if ((active_config_ready || pending_ready) && recoveryRequested()) {
        startProvisioning();
        if (!provisioning) sleepForMinutes(active_config_ready ? active_config.sleep_minutes : kFallbackSleepMinutes);
        return;
    }
    if (pending_ready) processConfiguredWake(pending, true);
    if (!active_config_ready) {
        startProvisioning();
        if (!provisioning) sleepForMinutes(kFallbackSleepMinutes);
        return;
    }
    processConfiguredWake(active_config, false);
}

void loop() {
    if (!provisioning) {
        sleepForMinutes(active_config_ready ? active_config.sleep_minutes : kFallbackSleepMinutes);
    }
    dns.processNextRequest();
    handleProvisioningClient();
    if (restart_requested) {
        delay(250);
        ESP.restart();
    }
    if (static_cast<uint32_t>(millis() - provisioning_started_ms) >= kProvisioningTimeoutMs) {
        Serial.println("Provisioning timed out");
        sleepForMinutes(active_config_ready ? active_config.sleep_minutes : kFallbackSleepMinutes);
    }
    delay(2);
}
